benchmark/write-read/lambda.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking hash.execute-api.eu-central-1.amazonaws.com (be patient)
Completed 1500 requests
Completed 3000 requests
Completed 4500 requests
Completed 6000 requests
Completed 7500 requests
Completed 9000 requests
Completed 10500 requests
Completed 12000 requests
Completed 13500 requests
Completed 15000 requests
Finished 15000 requests


Server Software:        
Server Hostname:        hash.execute-api.eu-central-1.amazonaws.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-RSA-AES128-GCM-SHA256,2048,128
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        hash.execute-api.eu-central-1.amazonaws.com

Document Path:          /Prod/invoke-lambda/
Document Length:        0 bytes

Concurrency Level:      1
Time taken for tests:   3256.744 seconds
Complete requests:      15000
Failed requests:        0
Total transferred:      7080000 bytes
HTML transferred:       0 bytes
Requests per second:    4.61 [#/sec] (mean)
Time per request:       217.116 [ms] (mean)
Time per request:       217.116 [ms] (mean, across all concurrent requests)
Transfer rate:          2.12 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:       30   43  16.4     40    1059
Processing:   111  174  55.6    161    1767
Waiting:      111  174  55.6    161    1767
Total:        147  217  58.1    202    1872

Percentage of the requests served within a certain time (ms)
  50%    202
  66%    214
  75%    222
  80%    229
  90%    260
  95%    306
  98%    382
  99%    447
 100%   1872 (longest request)